app/views/teams/show.html.erb


<% @team.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = ?  [["team_id", 1]]