app/controllers/teams_controller.rb

  def index
    @teams = Team.all
---
SELECT "teams".* FROM "teams"

  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("avatar_url", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["avatar_url", ""], ["created_at", "2014-11-20 14:40:39.086944"], ["name", "Allstars"], ["updated_at", "2014-11-20 14:40:39.086944"]]

  def update
    respond_to do |format|
      if @team.update(team_params)
---
UPDATE "teams" SET "avatar_url" = ?, "updated_at" = ? WHERE "teams"."id" = 2

  def register_user
    team = Team.find(params[:id])
---
SELECT  "teams".* FROM "teams"  WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]

    def set_team
      @team = Team.find(params[:id])
---
SELECT  "teams".* FROM "teams"  WHERE "teams"."id" = ? LIMIT 1  [["id", 2]]